wallCase-parCluster/constant/thermodynamicProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermodynamicProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

barotropicCompressibilityModel linear;

psiv            [0 -2 2 0 0] 5.499876831162818e-06; // PropsSI('d(D)/d(P)|S', 'T', 297.15, 'P', 2000, 'Water')

rholSat         [1 -3 0 0 0] 958.6315057778091; // PropsSI('D','P',100000,'Q',0,'Water')

rhovSat         [1 -3 0 0 0] 0.5903439801089505; // PropsSI('D','P',100000,'Q',1,'Water')

psil            [0 -2 2 0 0] 4.480303404981483e-07; // PropsSI('d(D)/d(P)|S', 'T', 297.15, 'P', 100000, 'Water')

pSat            [1 -1 -2 0 0] 2985.7979043823643; // PropsSI('P','T',297.15,'Q',0,'Water')

rhoMin          [1 -3 0 0 0] 0.00001;

// ************************************************************************* //
